readathon/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@user = User.find(params[:id])

INSERT INTO "users" ("name", "student_or_teacher", "age", "pages_read", "books_read", "reading_level", "book_list", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)

		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "student_or_teacher" = ?, "age" = ?, "pages_read" = ?, "books_read" = ?, "reading_level" = ?, "book_list" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
	def update
		@user = User.find(params[:id])
		if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
	def destroy
		@user = User.find(params[:id])
		@user.destroy