app/views/users/show.html.erb

SELECT "users2books".* FROM "users2books"
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	<strong>Their book list: </strong>
	<% @booklist = Users2book.all.each do |user2book| %>
		<% if user2book.userid === @user.id %>
			<p> <%= Bookitem.find_by_id(user2book.bookid).title %> </p>