app/controllers/bookitems_controller.rb

	def index
		@bookitems = Bookitem.all
---
SELECT "bookitems".* FROM "bookitems"

	def show
		@bookitem = Bookitem.find(params[:id])
---
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@bookitem  = Bookitem.find(params[:id])
---
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def create
		@bookitem = Bookitem.new(bookitem_params)

		if @bookitem.save
---
INSERT INTO "bookitems" ("title", "author", "pages", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Women and their ways"], ["author", "A. Clever Mann"], ["pages", "435"], ["created_at", 2017-03-07 05:39:31 UTC], ["updated_at", 2017-03-07 05:39:31 UTC]]

	def update
  		@bookitem = Bookitem.find(params[:id])

	  	if @bookitem.update(bookitem_params)
---
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "bookitems" SET "title" = ?, "author" = ?, "pages" = ?, "updated_at" = ? WHERE "bookitems"."id" = ?  [["title", "gar"], ["author", "777"], ["pages", "999"], ["updated_at", 2017-03-07 05:40:42 UTC], ["id", 3]]