app/controllers/bookitems_controller.rb

	def index
		@bookitems = Bookitem.all
---
SELECT "bookitems".* FROM "bookitems"

	def show
		@bookitem = Bookitem.find(params[:id])
---
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@bookitem  = Bookitem.find(params[:id])
---
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

	def create
		@bookitem = Bookitem.new(bookitem_params)

		if @bookitem.save
---
INSERT INTO "bookitems" ("title", "author", "pages", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Women and their ways"], ["author", "O. knee Hunk"], ["pages", "87324"], ["created_at", 2017-03-17 16:52:13 UTC], ["updated_at", 2017-03-17 16:52:13 UTC]]

	def update
  		@bookitem = Bookitem.find(params[:id])

	  	if @bookitem.update(bookitem_params)
---
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "bookitems" SET "author" = ?, "pages" = ?, "updated_at" = ? WHERE "bookitems"."id" = ?  [["author", "King Gerald"], ["pages", 432], ["updated_at", 2017-03-31 21:13:00 UTC], ["id", 4]]