app/controllers/leaderboard_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."pages_read" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
	@leaders = User.all.order(pages_read: :desc).first(5)