app/controllers/users_controller.rb

SELECT "users2books".* FROM "users2books"
SELECT "bookitems".* FROM "bookitems"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bookitems".* FROM "bookitems" WHERE "bookitems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show

		@users2books = Users2book.all
		@bookitems = Bookitem.all

		@user = User.find(params[:id])
		@newUserBook = Users2book.new

		@page_sum = 0
		@books_total = 0
			@booklist = Users2book.all.each do |user2book|
				if user2book.userid === @user.id
				 @page_sum = @page_sum + Bookitem.find_by_id(user2book.bookid).pages

INSERT INTO "users" ("name", "age", "pages_read", "books_read", "reading_level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Billy"], ["age", 8], ["pages_read", 65], ["books_read", 4], ["reading_level", "Beginner"], ["created_at", 2017-03-27 19:03:41 UTC], ["updated_at", 2017-03-27 19:03:41 UTC]]
---
	def create

		@user = User.new(user_params)

		@user.pages_read = 0
		@user.books_read = 0

		@user.reading_level = "Novice"

		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_teacher" = ?, "age" = ?, "pages_read" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_teacher", false], ["age", 222], ["pages_read", 23451], ["updated_at", 2017-03-31 21:03:43 UTC], ["id", 2]]
---
	def update
		@user = User.find(params[:id])
		if @user.update(user_params)