app/controllers/users2books_controller.rb

SELECT "users2books".* FROM "users2books"
SELECT "users".* FROM "users"
---
	def index
		@users2books = Users2book.all

		@users = User.all

SELECT  "users2books".* FROM "users2books" WHERE "users2books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show

		@users = User.all
		@bookitems = Bookitem.all

		@users2book = Users2book.find(params[:id])

SELECT "users".* FROM "users"
SELECT "bookitems".* FROM "bookitems"
---
	def new

		@users = User.all
		@bookitems = Bookitem.all

SELECT "users".* FROM "users"
SELECT "bookitems".* FROM "bookitems"
SELECT  "users2books".* FROM "users2books" WHERE "users2books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit

		@users = User.all
		@bookitems = Bookitem.all

		@users2book = Users2book.find(params[:id])

SELECT "users".* FROM "users"
SELECT "bookitems".* FROM "bookitems"
INSERT INTO "users2books" ("userid", "bookid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["userid", 3], ["bookid", 3], ["created_at", 2017-03-24 04:58:45 UTC], ["updated_at", 2017-03-24 04:58:45 UTC]]
---
	def create

		@users = User.all
		@bookitems = Bookitem.all

		@users2book = Users2book.new(users2book_params)

		if @users2book.save

SELECT  "users2books".* FROM "users2books" WHERE "users2books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users2books" SET "userid" = ?, "bookid" = ?, "updated_at" = ? WHERE "users2books"."id" = ?  [["userid", 5], ["bookid", 6], ["updated_at", 2017-03-24 06:05:14 UTC], ["id", 5]]
---
	def update

		@users = User.all
		@bookitems = Bookitem.all

		@users2book = Users2book.find(params[:id])
		if @users2book.update(users2book_params)

SELECT  "users2books".* FROM "users2books" WHERE "users2books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users2books" WHERE "users2books"."id" = ?  [["id", 1]]
---
	def destroy
		@users2book = Users2book.find(params[:id])
		@users2book.destroy