app/controllers/welcome_controller.rb

SELECT "users".* FROM "users"
SELECT "bookitems".* FROM "bookitems"
SELECT "users2books".* FROM "users2books"
---
  def masterview
    @users = User.all
	@bookitems = Bookitem.all
	@users2books = Users2book.all