app/views/users2books/index.html.erb

        <td>
          <% @indiv1 = User.all.each do |c1| %>
---
SELECT "users".* FROM "users"